app/views/users/show.html.erb

  <tbody>
    <% @user.hackathons.order(date: :asc).each_with_index do |hackathon, index| %>
---
SELECT "hackathons".* FROM "hackathons" INNER JOIN "hackathon_users" ON "hackathons"."id" = "hackathon_users"."hackathon_id" WHERE "hackathon_users"."user_id" = $1  ORDER BY "hackathons"."date" DESC  [["user_id", 1]]