app/controllers/hackathons_controller.rb

SELECT  "hackathons".* FROM "hackathons" WHERE "hackathons"."id" = $1 LIMIT 1  [["id", 122]]
---
  def show
    @hackathon = Hackathon.find(params[:id])